In [1]:
import pandas as pd
import numpy as np

In [2]:
bas_url = "https://datasets.imdbws.com/title.basics.tsv.gz"

In [3]:
aka_url = "https://datasets.imdbws.com/title.akas.tsv.gz"

In [4]:
rat_url = "https://datasets.imdbws.com/title.ratings.tsv.gz"

In [5]:
bas = pd.read_csv(bas_url, sep='\t', low_memory=False)

In [6]:
aka = pd.read_csv(aka_url, sep='\t', low_memory=False)

In [7]:
rat = pd.read_csv(rat_url, sep='\t', low_memory=False)

In [8]:
bas = bas.replace({'\\N':np.nan})
bas.value_counts()

tconst      titleType     primaryTitle                                         originalTitle                 isAdult  startYear  endYear  runtimeMinutes  genres
tt0025509   tvSeries      Les Misérables                                       Les misérables                0        1934       1934     279             Drama                1
tt21954264  tvSeries      Al Thania Baed Al Zuhr                               Al Thania Baed Al Zuhr        0        2009       2009     45              Crime                1
tt2195798   tvMiniSeries  Building Bryks                                       Building Bryks                0        2010       2011     30              Reality-TV           1
tt21959626  tvMiniSeries  Elevator Money                                       Elevator Money                0        2022       2022     30              Comedy               1
tt21960052  tvSeries      100 Masterworks from the Great Museums of the World  100 Great Paintings           0        1980       1994     10              Documentary,Short    1
                                                                                                                                                                              ..
tt10284122  tvMiniSeries  The 410                                              The 410                       0        2019       2019     78              Drama                1
tt10284168  tvSeries      Shin Bikkuriman                                      Shin Bikkuriman               0        1989       1990     30              Animation            1
tt10284700  tvMiniSeries  Pop Corner                                           Pop Corner                    0        1967       1968     20              Music,Talk-Show      1
tt10285032  tvSeries      I glossa tis tehnis                                  I glossa tis tehnis           0        1985       1985     40              Documentary          1
tt9916216   tvSeries      Kalyanam Mudhal Kadhal Varai                         Kalyanam Mudhal Kadhal Varai  0        2014       2017     22              Romance              1
Length: 46626, dtype: int64

In [9]:
aka = aka.replace({'\\N':np.nan})

In [10]:
rat = rat.replace({'\\N':np.nan})

In [11]:
bas.isna().sum()

tconst                  0
titleType               0
primaryTitle           11
originalTitle          11
isAdult                 1
startYear         1262301
endYear           9302364
runtimeMinutes    6770889
genres             431180
dtype: int64

In [12]:
bas.dropna(subset=['runtimeMinutes'], inplace = True)

In [13]:
bas.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 1
startYear           99611
endYear           2582366
runtimeMinutes          0
genres              68961
dtype: int64

In [14]:
bas.dropna(subset=['genres'], inplace = True)

In [15]:
bas.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 0
startYear           98276
endYear           2514977
runtimeMinutes          0
genres                  0
dtype: int64

In [16]:
bas.duplicated().sum()

0

In [17]:
bas['titleType'].value_counts()

tvEpisode       1207625
short            584021
movie            372423
video            177065
tvMovie           89152
tvSeries          87972
tvSpecial         17074
tvMiniSeries      16482
tvShort            9477
videoGame           312
Name: titleType, dtype: int64

In [18]:
bas[bas['titleType'].str.contains
    ('tvEpisode|short|video|tvMovie|tvSeries|tvSpecial|tvMiniSeries|tvShort|videoGame')
    ==False]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,NaN,45,Romance
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama
672,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908,NaN,120,"Adventure,Fantasy"
930,tt0000941,movie,Locura de amor,Locura de amor,0,1909,NaN,45,Drama
...,...,...,...,...,...,...,...,...,...
9401218,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
9401302,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama
9401343,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,0,2015,NaN,57,Documentary
9401370,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,0,2007,NaN,100,Documentary
9401403,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,0,2013,NaN,49,Documentary

In [19]:
bas = bas[bas['titleType'].str.contains
    ('tvEpisode|short|video|tvMovie|tvSeries|tvSpecial|tvMiniSeries|tvShort|videoGame')
    ==False]

In [20]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 372423 entries, 8 to 9401403
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          372423 non-null  object
 1   titleType       372423 non-null  object
 2   primaryTitle    372423 non-null  object
 3   originalTitle   372423 non-null  object
 4   isAdult         372423 non-null  object
 5   startYear       366482 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  372423 non-null  object
 8   genres          372423 non-null  object
dtypes: object(9)
memory usage: 28.4+ MB

In [21]:
bas['startYear'].value_counts()

2017    14239
2018    14183
2019    13856
2016    13855
2015    13365
        ...
1896        1
1894        1
1899        1
1904        1
2026        1
Name: startYear, Length: 128, dtype: int64

In [22]:
bas.dropna(subset=['startYear'], inplace = True)

In [23]:
bas['startYear'] = bas['startYear'].astype(int)

In [24]:
bas = bas[bas['startYear'] >= 2000]

In [25]:
bas = bas[bas['startYear'] <= 2022]

In [26]:
bas['startYear'].value_counts()

2017    14239
2018    14183
2019    13856
2016    13855
2015    13365
2014    13004
2013    12314
2021    11919
2012    11557
2020    11341
2022    11023
2011    10717
2010    10146
2009     9300
2008     8104
2007     6908
2006     6453
2005     5775
2004     5154
2003     4546
2002     4096
2001     3824
2000     3608
Name: startYear, dtype: int64

In [27]:
bas['startYear'] = bas['startYear'].astype(object)

In [28]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 219287 entries, 13079 to 9401403
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          219287 non-null  object
 1   titleType       219287 non-null  object
 2   primaryTitle    219287 non-null  object
 3   originalTitle   219287 non-null  object
 4   isAdult         219287 non-null  object
 5   startYear       219287 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  219287 non-null  object
 8   genres          219287 non-null  object
dtypes: object(9)
memory usage: 16.7+ MB

In [29]:
is_documentary = bas['genres'].str.contains('documentary',case=False)

In [30]:
bas = bas[~is_documentary]

In [31]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33967534 entries, 0 to 33967533
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 2.0+ GB

In [32]:
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [33]:
aka.duplicated().sum()

0

In [34]:
aka.isna().sum()

titleId                   0
ordering                  0
title                     5
region              1870552
language            6380855
types              28577344
attributes         33717025
isOriginalTitle        2187
dtype: int64

In [35]:
aka['region'].value_counts()

JP    4052999
FR    4052077
DE    4049662
IN    3985972
ES    3975653
       ...
CC          1
TV          1
NU          1
PW          1
NR          1
Name: region, Length: 247, dtype: int64

In [36]:
aka[aka['region'].str.contains('US') == True]

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0
...,...,...,...,...,...,...,...,...
33967205,tt9916702,1,Loving London: The Playground,US,NaN,NaN,NaN,0
33967242,tt9916720,10,The Demonic Nun,US,NaN,tv,NaN,0
33967244,tt9916720,12,The Nun 2,US,NaN,imdbDisplay,NaN,0
33967262,tt9916756,1,Pretty Pretty Black Girl,US,NaN,imdbDisplay,NaN,0
33967278,tt9916764,1,38,US,NaN,imdbDisplay,NaN,0

In [37]:
aka = aka[aka['region'].str.contains('US') == True]

In [38]:
aka['region'].value_counts()

US    1377810
Name: region, dtype: int64

In [39]:
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

In [40]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1377810 entries, 5 to 33967278
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1377810 non-null  object
 1   ordering         1377810 non-null  int64
 2   title            1377810 non-null  object
 3   region           1377810 non-null  object
 4   language         3736 non-null     object
 5   types            966633 non-null   object
 6   attributes       45365 non-null    object
 7   isOriginalTitle  1376435 non-null  object
dtypes: int64(1), object(7)
memory usage: 94.6+ MB

In [41]:
keep = bas['tconst'].isin(aka['titleId'])
keep

34793       True
61095       True
67643       True
77937      False
86773       True
           ...
9401125     True
9401134     True
9401173    False
9401218     True
9401302    False
Name: tconst, Length: 145063, dtype: bool

In [42]:
bas = bas[keep]
bas.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34793,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61095,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
67643,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
86773,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
93909,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [43]:
rat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1251094 entries, 0 to 1251093
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1251094 non-null  object
 1   averageRating  1251094 non-null  float64
 2   numVotes       1251094 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.6+ MB

In [44]:
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1924
1  tt0000002            5.8       259
2  tt0000003            6.5      1737
3  tt0000004            5.6       174
4  tt0000005            6.2      2550

In [45]:
rat.duplicated().sum()

0

In [46]:
rat.isna().sum()

tconst           0
averageRating    0
numVotes         0
dtype: int64

In [47]:
keepII = rat['tconst'].isin(aka['titleId'])
keepII

0           True
1           True
2          False
3          False
4           True
           ...
1251089    False
1251090     True
1251091    False
1251092    False
1251093    False
Name: tconst, Length: 1251094, dtype: bool

In [48]:
rat = rat[keepII]
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1924
1  tt0000002            5.8       259
4  tt0000005            6.2      2550
5  tt0000006            5.1       175
6  tt0000007            5.4       798

In [49]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 83634 entries, 34793 to 9401218
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          83634 non-null  object
 1   titleType       83634 non-null  object
 2   primaryTitle    83634 non-null  object
 3   originalTitle   83634 non-null  object
 4   isAdult         83634 non-null  object
 5   startYear       83634 non-null  object
 6   endYear         0 non-null      object
 7   runtimeMinutes  83634 non-null  object
 8   genres          83634 non-null  object
dtypes: object(9)
memory usage: 6.4+ MB

In [50]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1377810 entries, 5 to 33967278
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1377810 non-null  object
 1   ordering         1377810 non-null  int64
 2   title            1377810 non-null  object
 3   region           1377810 non-null  object
 4   language         3736 non-null     object
 5   types            966633 non-null   object
 6   attributes       45365 non-null    object
 7   isOriginalTitle  1376435 non-null  object
dtypes: int64(1), object(7)
memory usage: 94.6+ MB

In [51]:
rat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 476546 entries, 0 to 1251090
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         476546 non-null  object
 1   averageRating  476546 non-null  float64
 2   numVotes       476546 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 14.5+ MB

In [52]:
import os
os.makedirs('Data/',exist_ok=True) 

os.listdir("Data/")

['.ipynb_checkpoints',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz',
 'tmdb_api_results_2001.json']

In [53]:
bas.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [54]:
bas = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
bas.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [55]:
aka.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [56]:
aka = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [57]:
rat.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [58]:
rat = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1924
1  tt0000002            5.8       259
2  tt0000005            6.2      2550
3  tt0000006            5.1       175
4  tt0000007            5.4       798

In [59]:
import os, time,json
import tmdbsimple as tmdb 
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['.ipynb_checkpoints',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz',
 'tmdb_api_results_2001.json']

In [60]:
def write_json(new_data, filename): 
    """Appends a list of records (new_data) to a json file (filename). 
    Adapted from: https://www.geeksforgeeks.org/append-to-json-file-using-python/"""  
    
    with open(filename,'r+') as file:
        # First we load existing data into a dict.
        file_data = json.load(file)
        ## Choose extend or append
        if (type(new_data) == list) & (type(file_data) == list):
            file_data.extend(new_data)
        else:
             file_data.append(new_data)
        # Sets file's current position at offset.
        file.seek(0)
        # convert back to json.
        json.dump(file_data, file)

In [61]:
bas = pd.read_csv("Data/title_basics.csv.gz")

In [62]:
YEARS_TO_GET = [2000,2001]

In [63]:
errors = [ ]

In [64]:
def get_movie_with_rating(movie_id):
    """Adapted from source = https://github.com/celiao.tmdbsimple"""
    # Get the movie object for the current id
    movie = tmdb.Movies(movie_id)
    
    # save the .info .releases dictionaries
    info = movie.info()
    
    releases = movie.releases()
    # Loop through countries in releases
    for c in releases['countries']:
        # if the country abbreviation==US
        if c['iso_3166_1'] == 'US':
            # save a "certification" key in info with the certification
            info['certification'] = c['certification']
    return info

In [65]:
# Start of OUTER loop
from tqdm.notebook import tqdm_notebook
for YEAR in tqdm_notebook(YEARS_TO_GET, desc = 'YEARS', position = 0):
    print(YEAR)
    
    #Defining the JSON file to store results for year
    JSON_FILE = f'{FOLDER}tmdb_api_results_{YEAR}.json'
    
    # Check if file exists
    file_exists = os.path.isfile(JSON_FILE)
    
    # If it does not exist: create it
    if file_exists == False:
    # save an empty dict with just "imdb_id" to the new json file.
        with open(JSON_FILE,'w') as f:
            json.dump([{'imdb_id':0}],f)
            
    #Saving new year as the current df
    df = bas.loc[bas['startYear']==YEAR].copy()
    # saving movie ids to list
    movie_ids = df['tconst'].copy()
    
    # Load existing data from json into a dataframe called "previous_df"
    previous_df = pd.read_json(JSON_FILE)
    
    # filter out any ids that are already in the JSON_FILE
    movie_ids_to_get = movie_ids[~movie_ids.isin(previous_df['imdb_id'])]
    
    #Get index and movie id from list
    # INNER Loop
    for movie_id in tqdm_notebook(movie_ids_to_get,
                                  desc=f'Movies from {YEAR}',
                                  position=1,
                                  leave=True):
        try:
            # Retrieve then data for the movie id
            temp = get_movie_with_rating(movie_id)  
            # Append/extend results to existing file using a pre-made function
            write_json(temp,JSON_FILE)
            # Short 20 ms sleep to prevent overwhelming server
            time.sleep(0.02)
            
        except Exception as e:
            errors.append([movie_id, e])

YEARS:   0%|          | 0/2 [00:00<?, ?it/s]

2000

Movies from 2000:   0%|          | 0/1418 [00:00<?, ?it/s]

2001

Movies from 2001:   0%|          | 0/1535 [00:00<?, ?it/s]

In [73]:
final_year_df = pd.read_json(JSON_FILE)
final_year_df.to_csv(f"{FOLDER}final_tmdb_data_{YEAR}.csv.gz", compression="gzip", index=False)

In [74]:
print(f"- Total errors: {len(errors)}")

- Total errors: 2953